{
  "_id": "page.navigation",
  "_type": "page.content",
  "body": "All services start with a start page.\r\n\r\nWhen you install the editor (with or without the 'example service' installed), it includes a start page. You can edit this page for the service you're building.\r\n\r\nIf you're running the service on port 3000 (for example), access the start page at [http://localhost:3000](http://localhost:3000).\r\n\r\nYou can always quickly get to your start page by clicking:\r\n\r\n* the GOV.UK link (top left)\r\n* your service's name (top centre)\r\n\r\n## Service navigation links\r\n\r\nThe top blue navigation has 3 links top left:\r\n\r\n### Dashboard\r\n\r\nShows you:\r\n\r\n* the pages in your service\r\n* a link to edit your service details (name, phase etc)\r\n\r\n### Page flow\r\n\r\nA flow diagram of how your service's pages link together.\r\n\r\n### Add page\r\n\r\nLets you [add a page](/add-page) to your service.\r\n\r\n## Page editing/view modes\r\n\r\nIf you edit a page or component, you'll see 4 more links appear (blue navigation bar, top right)\r\n\r\n### Live view\r\n\r\nShows you how the page will display to a user.\r\n\r\nIf the page or its components contain conditional logic, the page will display (or not) based on answers the user has \r\nalready given.\r\n\r\n### Preview mode\r\n\r\nShows you all the possible contents of the page.\r\n\r\nFor example, if the page has conditional logic to show one of several possible components to any given user, preview mode will show you **all** of the possible components.\r\n\r\nYou'll see an extra navigation bar (light blue) at the top of the screen, allowing you to easily navigate forwards and backwards through your form.\r\n\r\n### Properties mode\r\n\r\nA 'back end' or 'CMS' editing mode.\r\n\r\nIt allows you to edit all the properties for a page, component or item, and the raw JSON.\r\n\r\n### Build mode\r\n\r\nAn editing mode, similar to preview: it shows all components on a page.\r\n\r\nClick on the pencil (✎) or brackets ('{}') icons to edit that part of the page.",
  "components": [
    {
      "_id": "page.navigation--inset",
      "_type": "inset",
      "html": "[Back to contents](/contents)"
    }
  ],
  "heading": "Page view and editing modes",
  "url": "navigation"
}