{
  "_id": "page.editpages",
  "_type": "page.content",
  "body": "Navigate to the page you want to edit. You can navigate to a page using one of the links in the top navigation bar:\r\n\r\n- Dashboard\r\n- Page flow\r\n- Preview mode\r\n- Wysiwyg mode\r\n\r\n## Editing using 'instance mode'\r\n\r\nInstance mode lists all the properties you can edit on that page.\r\n\r\nIf you’ve not set all the mandatory properties, a message at the top will tell you what to do. \r\n\r\n## Editing using 'Wysiwyg mode'\r\n\r\nWysiwyg shows you the visual components on a page. Click on the symbols next to the part of the page you want to edit.\r\n\r\n## Click the green 'Update' button to save your changes\r\n\r\nWhen you edit part of a page, there's a green update button. Click this to make and save your changes.\r\n\r\nThis updates the JSON in your service's files.\r\n \r\n## What each property does \r\n\r\n- **Based on**: makes the page inherit values from another page\r\n- **Url**: relative url for the page\r\n- **Heading**: sets the H1\r\n- **Lede**: sets the first paragraph after the H1\r\n- **Content**: sets the body content\r\n- **Enable steps**: allows this page to have steps that follow from it\r\n- **Steps**: sets the steps that follow from this page\r\n- **Primary action**: sets a string (or key to look up a string) to use for the page's primary action (such as the main button)\r\n- **Section heading**: sets the content to use as the page's section heading\r\n- **Steps heading**: sets the content to use as the section heading on pages which are this page's steps\r\n- **Repeatable**: lets you add repeatable form elements to the page\r\n- **Logical properties**: sets the conditions for whether a page should be shown\r\n- **Additional properties**: sets the html <title> tag and any additional components",
  "components": [
    {
      "_id": "page.editpages--inset",
      "_type": "inset",
      "html": "[Back to contents](/contents)"
    }
  ],
  "heading": "Editing pages",
  "url": "edit-pages"
}